docs: simplify frontend tech stack description and added ASCII visualization in README
